In [1]:
import numpy as np 
import pandas as pd

In [2]:
d = {"A": [1,2,np.nan], "B": [5,6,np.nan], "C": [1,2,3]} #indicamos con np.nan que nos hace falta algún valor NaN values

In [3]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2
2  NaN  NaN  3

In [4]:
df.dropna() #esto es para que nos de las filas en las que no se presenta los valores NaN

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2

In [5]:
#ahora veamos el caso en el que queramos que nos arroje sólo las columnas, entonces tenemos que poner (axis=1), arriba nos dió el valor por default de axis=0, por lo que 
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [6]:
#ahora veamos cómo podemos hacer que nos arroje por lo menos las filas donde tienen al menos dos elementos no NaN 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2

In [7]:
df.dropna(axis=1, thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2
2  NaN  NaN  3

In [8]:
#si quisiéramos completar las valores de NaN hacemos lo siguiente:
df.fillna("Hi, I´m new")

             A            B  C
0            1            5  1
1            2            6  2
2  Hi, I´m new  Hi, I´m new  3

In [9]:
#ahora veamos el caso en el que deseemos sólo cambiar el valor de NaN de 2,A
df["A"].fillna(df["A"].mean()) #lo que hace .mean es sacar el promedio de los valores aquí establecidos

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [10]:
data = {
    "FAC" : ["F.C", "F.C", "FES. A", "FES. C", "FES. C"],
    "Person" : ["FerBOn", "Ana", "Ale", "Air", "Tenn"],
    "Average" : [10,10,7,9,10]
}

In [11]:
df1 = pd.DataFrame(data)

In [12]:
df1

      FAC  Person  Average
0     F.C  FerBOn       10
1     F.C     Ana       10
2  FES. A     Ale        7
3  FES. C     Air        9
4  FES. C    Tenn       10

In [13]:
#vamos a agrupar las Facultades ;) 
group_fac = df1.groupby("FAC")
group_fac

In [14]:
group_fac.sum()

        Average
FAC
F.C          20
FES. A        7
FES. C       19

In [15]:
group_fac.mean()

        Average
FAC
F.C        10.0
FES. A      7.0
FES. C      9.5

In [16]:
group_fac.std() #es desviación estandar

         Average
FAC
F.C     0.000000
FES. A       NaN
FES. C  0.707107

In [17]:
group_fac.sum().loc["F.C"] #esto lo hacemos si deseamos que nos de la suma de un sólo grupo de datos

Average    20
Name: F.C, dtype: int64

In [18]:
group_fac.count() #nos da el número de datos que hay en cada grupo de datos

        Person  Average
FAC
F.C          2        2
FES. A       1        1
FES. C       2        2

In [19]:
group_fac.max() #nos da el valor más grande de cada grupo de datos, es análogo con el valor más pequeño

        Person  Average
FAC
F.C     FerBOn       10
FES. A     Ale        7
FES. C    Tenn       10

In [22]:
group_fac.describe() #veammos que los valores de sacamos arriba con la función .describe()
group_fac.describe().transpose() #esto si queremos transponer los datos

FAC             F.C  FES. A     FES. C
Average count   2.0     1.0   2.000000
        mean   10.0     7.0   9.500000
        std     0.0     NaN   0.707107
        min    10.0     7.0   9.000000
        25%    10.0     7.0   9.250000
        50%    10.0     7.0   9.500000
        75%    10.0     7.0   9.750000
        max    10.0     7.0  10.000000